2026-04-08 23:50 aef9c23 权限管理模块开发 ：权限管理、SpringSecurity、JWT；
2026-04-08 11:39 37cd561 SpringBoot日志实战；社区资产管理模块开发：功能7：小区下拉列表展示；
2026-04-08 09:42 01f6ed9 SpringBoot日志实战_logback整合；
2026-04-07 22:04 ecd2a1b 每日自动提交 [2026-04-07 22:04:43] (无代码变更)
2026-04-07 20:30 de991f2 每日自动提交 [2026-04-07 20:30:58] (无代码变更)
2026-04-07 20:27 3fb360a 每日自动提交 [2026-04-07 20:27:38] (无代码变更)
2026-04-07 20:23 834eea2 每日自动提交 [2026-04-07 20:23:48] (无代码变更)
2026-04-07 20:20 ca0c99e 每日自动提交 [2026-004-007 20:20:03] (无代码变更)
2026-04-07 20:15 0c7c138 每日自动提交 [周二 2026-04 20:15:55] (无代码变更)
2026-04-07 20:13 041068a 每日自动提交 [2026-04-07 20:13:32] (无代码变更)
2026-04-07 19:58 b08a1e8 每日自动提交 [2026-04-07 19:58:16] (无代码变更)
2026-04-07 19:56 495ad85 每日自动提交 [2026-04-07 19:56:43] (无代码变更)
2026-04-07 19:54 4e0edbf 每日自动提交 [2026-04-07 19:54:09] (无代码变更)
2026-04-07 19:51 51f614d 每日自动提交 [2026-04-07 19:51:47] (无代码变更)
2026-04-07 19:50 3d4c7e5 ÿ���Զ��ύ [周二 2026-04 19:50:29] (�޴�����)
2026-04-07 19:46 2d3e23f  (无代码变更)
2026-04-07 19:39 7db9869  (无代码变更)
2026-04-07 19:36 b6dd7cb  (无代码变更)
2026-04-07 19:33 4c2694d  (无代码变更)
2026-04-07 17:18 1dd1070 每日自动提交
2026-04-07 17:12 305ce8f 社区资产管理模块开发功能3：修改小区信息、4：删除小区信息、5：更换业务、6：导出Excel、EasyPOI的学习（导入导出Excel、导入导出多个sheet页、集成web实现导入导出）;
2026-04-06 23:46 f7014c8 合家云项目：社区资产管理模块开发功能：小区数据的多条件分页查询；新增小区；获取完整的省市区树形结构JSON数据；
2026-04-04 23:52 6762990 4.3：合家云社区物业管理平台1. 后台架构设计 2. 合家云需求设计&项目基础结构搭建；
2026-04-02 16:39 5a56661 SpringSecurity授权操作；
2026-04-02 14:33 1fd6250 4.1：SpringSecurity认证流程和自定义SpringSecurity认证；
2026-03-31 20:58 c57ceb8 Redis(待完善);
2026-03-30 22:42 cfb5b37 空气质量检测系统；
2026-03-30 08:57 e9c4ccd SpringBootException；
2026-03-29 23:53 71116a3 SpringBoot02;
2026-03-28 23:58 1552bf5 3.27：SpringMVC02;3.28:SpringBoot01；
2026-03-26 20:17 a849810 SpringMVC-01；
2026-03-25 14:41 c714979 Spring 事务；
2026-03-25 11:29 8c995c3 Spring JDBC；
2026-03-24 23:02 05189c3 3.23日：完成了Spring6的Spring IOC DI - 整合Mybatis部分；3.24日：完成了Spring6的SpringAOP部分；
2026-03-23 22:39 11f60a5 Spring6的Spring IOC DI - 整合Mybatis部分；（还有问题未解决）
2026-03-22 21:57 e843f53 MyBatis
2026-03-21 22:42 d7ac411 MyBatis
2026-03-20 21:27 1a12007 学习了前端基础和Maven；
2026-03-16 22:55 12060cb 完成了JDBC课程余下所有内容，未进行太多练习，只进行了观看；
2026-03-15 21:08 d34cb14 完成了JDBC课程前60%
2026-03-14 21:31 598e5c8 移除主仓库中Algorithm子模块引用，独立管理算法仓库
2026-03-14 21:27 e4732af 新增.gitignore，忽略Algorithm文件夹
2026-03-14 21:11 01f91fb 完成了MySQL,无代码推送；新开了JDBC课程，新建项目，暂无代码
2026-03-14 00:12 7268dbc 脚本尝试
2026-03-12 18:01 0f5911c 初始化提交：上传Idea_workscope下的所有Java项目